# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [9]:
series1 = pd.Series(np.random.randint(1, 4, 100))
series2 = pd.Series(np.random.randint(1, 3, 100))
series3 = pd.Series(np.random.randint(10000, 30000, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [10]:
df = pd.concat([series1, series2, series3], axis = 1)

In [12]:
df.head(2)

   0  1      2
0  3  2  12767
1  2  1  27956

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [15]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df.head(1)

   bedrs  bathrs  price_sqr_meter
0      3       2            12767

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [21]:
bigcolumn = series1.append([series2, series3])
bigcolumn = pd.DataFrame(bigcolumn)
bigcolumn

        0
0       3
1       2
2       2
3       1
4       1
..    ...
95  27935
96  17686
97  23127
98  26104
99  25704

[300 rows x 1 columns]

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [23]:
bigcolumn.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [24]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn.index

RangeIndex(start=0, stop=300, step=1)